app/Prose.php

select `proses`.*, (select count(*) from `verses` where `proses`.`id` = `verses`.`prose_id` and `status` = 1) as `verse_count` from `proses` having `verse_count` > 0 order by RAND()
---
    public function only_with_data()
    {
        $proses = Prose::with(['verse' => function ($query) {
            $query->where('status', 1);
        }])->withCount(['verse' => function ($query) {
            $query->where('status', 1);
        }])->having('verse_count', '>', 0)->get();