app/Http/Controllers/ProseController.php

    public function show(Prose $prose, Request $request)
    {
        $verses = Verse::where('prose_id', $prose->id)->get();
---
select * from `verses` where `prose_id` = 1

    public function projector()
    {
        $proses = Prose::with(['verse' => function ($query) {
            $query->where('status', 1);
        }])->withCount(['verse' => function ($query) {
            $query->where('status', 1);
        }])->having('verse_count', '>', 0)->get();
---
select * from `proses`