app/Http/Controllers/ThemeController.php

    public function index(Request $request)
    {
        $themes = Theme::take(Setting::where('name', 'home_limit_theme')->first()->value)->get();
        $themesCollection = collect([]);

        /* Create a collection with is_full = 0 */
        foreach ($themes as $theme) {
            $themesCollection->push($theme->proses->where('is_full', 0));
        }

        $limit = Setting::where('name', 'home_limit_prose')->first()->value;
        $size_column = 12 / count($themes);
        return view('welcome')->with(compact('themes', 'size_column', 'themesCollection', 'limit'));
---
select * from `settings` where `name` = 'home_limit_theme' limit 1
select * from `settings` where `name` = 'home_limit_prose' limit 1
select * from `themes` limit 3

    public function show(Theme $theme)
    {
        $proses = Prose::with(['verse' => function ($query) {
            $query->where('status', 1);
        }])->where('theme_id', $theme->id)->get();
---
select * from `proses` where `theme_id` = 2
select * from `verses` where `verses`.`prose_id` in (3, 4) and `status` = 1