app/Http/Controllers/Admin/AdminProseController.php

    public function index(Theme $theme)
    {
        $proses = Prose::all()->where('theme', $theme);
        return view('admin.proses.index', $theme)->with(compact('theme', 'proses'));
---
select * from `proses`

    public function all()
    {
        $proses = Prose::all()->sortByDesc('id');
---
select * from `proses`