app/Http/Controllers/Admin/AdminThemeController.php

    public function index()
    {
        $themes = Theme::all();
---
select * from `themes`