app/Http/Controllers/Admin/AdminSettingController.php

select * from `settings`
---
    public function index()
    {
        $settings = Setting::all();