app/Http/Controllers/Admin/AdminVerseController.php

    public function index(Theme $theme, Prose $prose)
    {
        $verses = Verse::all()->where('prose', $prose);
        return view('admin.verses.index', $prose)->with(compact('theme', 'prose', 'verses'));
---
select * from `proses` where `proses`.`id` in (1, 2, 3, 4, 5, 6)
select * from `verses`

    public function create(Theme $theme, Prose $prose)
    {
        $proses = Prose::all();
---
select * from `proses`

    public function store(Request $request, Theme $theme, Prose $prose)
    {
        $verse = new Verse($request->all());
        $verse->save();
---
insert into `verses` (`content`, `prose_id`, `status`, `updated_at`, `created_at`) values ('13', '1', '1', '2019-07-18 05:36:25', '2019-07-18 05:36:25')